{"mainText":"To the folks at Apple and his family I send my sincere condolences. I find it fitting that I write this on a device that probably evokes the true spirit of Apple as a company and Steve as a directive force.\n\nI remember clearly back in 1984 when my father, who worked for IBM at the time brought home the first Macintosh computer. He told me never to divulge the fact that he owned this machine. I remember that whenever he bought a personal computer it was always an Apple.\n\nMany years later I purchased for my company an iMac G5 and needed to add memory. This required me to remove the back of the machine. I marveled at how elegantly this simple process worked. Upon opening the machine I was amazed to find that the interior of this device was as detailed and sculpted as the beautiful exterior. This attention to detail, in an area which most users would never see, electrified my imagination. Here was a Company that was committed to every aspect of design no matter how small.\n\nThis kind of focus does not happen by accident. Steve and the Company he helped build, not once, but twice, is what it is today because of that focus. Nothing is left to chance. Elegance is not a term left for a Paris Fashion show. It is a simple, powerful way of thinking, of seeing the world as a stage to present the very best that can be done.\n\nSteve has influenced my own small corner of the world. My creative company uses many of the same sets of values that I have learned from reading about Steve and Apple. Strive for excellence in everything you do. Look forward to what's around the corner. Enjoy the challenge of creating a great company. Never settle for second best. Never give up.\n\nAs the years have gone on I have found that I own many of the great devices that Apple has produced. None of which will I ever sell. It's not because I want to start my own Apple museum, but I see them as representing a little piece of Apple as a company and Steve as a person.\n\nI send to Steve's family my most sincere and heartfelt condolences. I wish for Apple the most incredible future that a Company can hope for.&nbsp;","header":"Thoughts on Steve","author":"Sean","location":""}