{"mainText":"I don't understand why I am so sad. I was told the news and I cried for \na long time. Why? Surely people who knew him and his family most \nespecially are the ones who deserve grief. Not me.\n\nFor some reason I cared for him even though I had no connection to him \nother than enjoying his products. I grew up in an Apple reseller in \nAustralia, so as a boy I lived Apple. So I've always felt connected to \nhis vision, his dream. The children's theatre company I run I have \nmodelled on him and the way he ran Apple. Don't take any notice of what \nthe other guys are doing. Just do the best products you can. Make people \nfeel amazing, delight them with what you create. And demand high \nstandards from those working with you. We even modelled our advertising \nafter the Mac vs PC ads, comparing our shows with other companies shows!\n\nAnd the odd thing, all day yesterday even though I did not know he was \ndying, I was watching old keynotes on youtube of Steve. The one from \nWWDC in 1997 before he became the iCEO. The 1998 one, a bunch of others. \nJust had it on in the background for hours and hours whilst I worked and \nate.\n\nVery strange.\n\nI emailed him one time to talk about his disease and to look at the \nemotional causes behind it. He of course went down the path of trying to \nheal it on a physical level. And there's so much grief about losing him, \neven though I know he's not gone forever. I'm not talking about heaven \nor hell, I'm just saying he is alive in spirit and will have a whole new \njourney in the spirit world.\n\nI love you Steve. I will feel this for a long time, but I hope that your \nnext journey will bring such joy and adventure for you, as you discover \nnew things to create and be, and I hope we one day meet up again.\n\nAfter all, it's best if we do not project our grief at him. Let him go, \nlet him be on his new path. I will do my best to quickly deal with the \ngrief, and lovingly from afar support his family to take whatever time \nthey need to do so too.\n\nYou are insanely great and we will definitely miss you.&nbsp;","header":"Love you Steve","author":"Ben","location":"from Australia"}