{"mainText":"Although I know I'll be one of millions of people who are sending an  \nemail 'Remembering Steve' or updating my Facebook or Twitter to RIP  \nSteve Jobs, I feel like writing this anyway just because I have had a  \ngreat experience with Apple products and really admire the work ethic  \nof this company created by such a tremendous visionary. A couple of  \nyears ago I attended a business summer program called LEAD at Stanford  \nUniversity for high school students. In this month we were given the  \ntask to create a business idea or product that we would present in  \nfront of different entrepreneurs and some employees from Apple at the  \nApple headquarters in California. What we didn't know was that all 30  \nof us who participated in this program would win iPod Shuffles. We  \nalso didn't know that the winning group would receive free MacBooks; a  \ngift from Apple, one of the program's sponsors. I certainly had no  \nidea that I would form part of this winning group, and would end up  \nreceiving one of the gifts I'm most proud of winning: my MacBook from  \nwhich I'm typing right now, 3 and a half years after winning it and  \nstill as new as the first day. When I presented my group's business  \nidea at the Apple headquarters, the employees told us that we would be  \nstepping on the same stage as the one Steve Jobs had stepped on when  \nmaking his presentations. This was amazing news to me; I felt honored.  \nI felt even more honored when we got the opportunity to eat lunch with  \nsome of the employees at Apple and were able to have great  \nconversations with them about their jobs and how much they enjoyed  \nworking at Apple. All I want to say is that even though I never met  \nhim, I feel very happy that I was able to meet people that might have  \nmet or might have been close to such a great visionary man in our  \nworld. I felt extremely comfortable and welcome in the headquarters  \nand am always grateful for the gift they gave me. I will stick to  \nApple not only because I love the products, but because I admire and  \nrespect the people that work there and the one that started it all:  \nSteve Jobs. As many people say, \"once you go Mac, you never go back!\"  \nVery true fact. Thanks!\n","header":"Interesting Connection - RIP Steve","author":"Camille","location":""}